<!-- pipecd-plan-preview-->
[![PLAN_PREVIEW](https://img.shields.io/static/v1?label=PipeCD&message=Plan_Preview&color=success&style=flat)](https://pipecd.dev/docs/user-guide/plan-preview/) [![ACTIONS](https://img.shields.io/static/v1?label=PipeCD&message=Action_Log&style=flat)](https://github.com/pipe-cd/examples/actions/runs/2106884969)

Ran plan-preview against head commit 49862b4d4accb8eba923313c3c54ddd2f4376853 of this pull request. PipeCD detected `2` updated applications and here are their plan results. Once this pull request got merged their deployments will be triggered to run as these estimations.

## app: [helm-remote-chart](https://play.pipecd.dev/applications/36347720-8f03-417d-8465-094f7d4eb4b1), env: example, kind: kubernetes
Sync strategy: QUICK_SYNC
Summary: 0 added manifests, 2 changed manifests, 0 deleted manifests

<details>
<summary>Details (Click me)</summary>
<p>

``` diff
--- Last Deploy
+++ Head Commit

# 1. name="helm-remote-chart-helloworld", kind="Deployment", namespace="default", apiVersion="apps/v1"

@@ -5,8 +5,8 @@
     app.kubernetes.io/instance: helm-remote-chart
     app.kubernetes.io/managed-by: Helm
     app.kubernetes.io/name: helloworld
-    app.kubernetes.io/version: v0.11.0
-    helm.sh/chart: helloworld-v0.11.0
+    app.kubernetes.io/version: v0.27.1
+    helm.sh/chart: helloworld-v0.27.1
   name: helm-remote-chart-helloworld
 spec:
   replicas: 1
@@ -23,11 +23,11 @@
       containers:
       - args:
         - server
-        image: gcr.io/pipecd/helloworld:v0.11.0
+        image: gcr.io/pipecd/helloworld:v0.27.1
         imagePullPolicy: IfNotPresent
         livenessProbe:
           httpGet:
-            path: /
+            path: /healthz
             port: admin
         name: helloworld
         ports:
@@ -36,7 +36,7 @@
           protocol: TCP
         readinessProbe:
           httpGet:
-            path: /
+            path: /healthz
             port: admin
         resources: {}
         securityContext: {}
# 2. name="helm-remote-chart-helloworld", kind="Service", namespace="default", apiVersion="v1"

@@ -5,8 +5,8 @@
     app.kubernetes.io/instance: helm-remote-chart
     app.kubernetes.io/managed-by: Helm
     app.kubernetes.io/name: helloworld
-    app.kubernetes.io/version: v0.11.0
-    helm.sh/chart: helloworld-v0.11.0
+    app.kubernetes.io/version: v0.27.1
+    helm.sh/chart: helloworld-v0.27.1
   name: helm-remote-chart-helloworld
 spec:
   ports:


```
</p>
</details>

## app: [simple](https://play.pipecd.dev/applications/ece10473-0cdb-4fec-96a1-a3df8f2e3c6e), env: example, kind: terraform
Sync strategy: QUICK_SYNC
Summary: 1 to add, 0 to change, 1 to destroy

<details>
<summary>Details (Click me)</summary>
<p>

``` hcl
Terraform will perform the following actions:

  # google_storage_bucket_object.object must be replaced
-/+ resource "google_storage_bucket_object" "object" {
      ~ content          = (sensitive value) # forces replacement
      ~ content_type     = "text/plain; charset=utf-8" -> (known after apply)
      ~ crc32c           = "q/GYqQ==" -> (known after apply)
      ~ detect_md5hash   = "ydxEf1G60kRGWDL3ezAglg==" -> "different hash" # forces replacement
      - event_based_hold = false -> null
      ~ id               = "pipecd-play-terraform-examples-simple/default.txt" -> (known after apply)
      + kms_key_name     = (known after apply)
      ~ md5hash          = "ydxEf1G60kRGWDL3ezAglg==" -> (known after apply)
      ~ media_link       = "https://storage.googleapis.com/download/storage/v1/b/pipecd-play-terraform-examples/o/simple%2Fdefault.txt?generation=1648021023536090&alt=media" -> (known after apply)
      - metadata         = {} -> null
        name             = "simple/default.txt"
      ~ output_name      = "simple/default.txt" -> (known after apply)
      ~ self_link        = "https://www.googleapis.com/storage/v1/b/pipecd-play-terraform-examples/o/simple%2Fdefault.txt" -> (known after apply)
      ~ storage_class    = "STANDARD" -> (known after apply)
      - temporary_hold   = false -> null
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
1 to add, 0 to change, 1 to destroy

```
</p>
</details>
